{
  "backend/main.mo": "Empty Motoko actor with no functionality defined.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: landing page with business info, call button, WhatsApp booking button, and vibrant playful visual theme with orange accent colors.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for hero banner, business info, character showcase, service highlights, contact buttons, footer, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color tokens including neutral grays, accent colors, and sidebar variables.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Brother's Live Cartoon', and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component composing header, hero banner, business info, character showcase, service highlights, contact buttons, and footer in a gradient background layout.",
  "frontend/src/components/BusinessInfo.tsx": "Component displaying business address and phone number in two cards with MapPin and Phone icons from lucide-react.",
  "frontend/src/components/CharacterShowcase.tsx": "Component displaying six cartoon characters (Gorilla, Red Teddy, Yellow Teddy, Doraemon, Mickey Mouse, Motu-Patlu) in a responsive grid with hover effects and generated images.",
  "frontend/src/components/ContactButtons.tsx": "Component with 'Call Now' button (opens tel: link) and 'Book on WhatsApp' button (opens WhatsApp with prefilled message) for phone number 9427065911.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component displaying generated hero image with gradient overlay and 'Live Cartoon Characters' title with animated sparkle icons.",
  "frontend/src/components/ServiceHighlights.tsx": "Component displaying event types (Birthday Party, Wedding Entry) and service highlights (High Quality Costumes, Energetic Performers, Reasonable Rates) in two cards.",
  "frontend/src/hooks/useActor.ts": "React hook for managing ICP backend actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend API calls are needed since all functionality is client-side (phone dialer and WhatsApp links).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components, charts, and sidebar.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH colors, container settings, border radius variables, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata describing a Flutter app for Brother's Live Cartoon character booking service with business info display, call/WhatsApp contact features, and required mascot character images."
}